<?php
require("../../inc/header.php");

/*
		SoftName : EmpireBak Version 2010
		Author   : wm_chief
		Copyright: Powered by www.phome.net
*/

DoSetDbChar('utf8');
E_D("DROP TABLE IF EXISTS `ecs_order_info`;");
E_C("CREATE TABLE `ecs_order_info` (
  `order_id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,
  `order_sn` varchar(20) NOT NULL DEFAULT '',
  `user_id` mediumint(8) unsigned NOT NULL DEFAULT '0',
  `order_status` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `shipping_status` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `pay_status` tinyint(1) unsigned NOT NULL DEFAULT '0',
  `consignee` varchar(60) NOT NULL DEFAULT '',
  `country` smallint(5) unsigned NOT NULL DEFAULT '0',
  `province` smallint(5) unsigned NOT NULL DEFAULT '0',
  `city` smallint(5) unsigned NOT NULL DEFAULT '0',
  `district` smallint(5) unsigned NOT NULL DEFAULT '0',
  `address` varchar(255) NOT NULL DEFAULT '',
  `zipcode` varchar(60) NOT NULL DEFAULT '',
  `tel` varchar(60) NOT NULL DEFAULT '',
  `mobile` varchar(60) NOT NULL DEFAULT '',
  `email` varchar(60) NOT NULL DEFAULT '',
  `best_time` varchar(120) NOT NULL DEFAULT '',
  `sign_building` varchar(120) NOT NULL DEFAULT '',
  `postscript` varchar(255) NOT NULL DEFAULT '',
  `shipping_id` tinyint(3) NOT NULL DEFAULT '0',
  `shipping_name` varchar(120) NOT NULL DEFAULT '',
  `pay_id` tinyint(3) NOT NULL DEFAULT '0',
  `pay_name` varchar(120) NOT NULL DEFAULT '',
  `how_oos` varchar(120) NOT NULL DEFAULT '',
  `how_surplus` varchar(120) NOT NULL DEFAULT '',
  `pack_name` varchar(120) NOT NULL DEFAULT '',
  `card_name` varchar(120) NOT NULL DEFAULT '',
  `card_message` varchar(255) NOT NULL DEFAULT '',
  `inv_payee` varchar(120) NOT NULL DEFAULT '',
  `inv_content` varchar(120) NOT NULL DEFAULT '',
  `goods_amount` decimal(10,2) NOT NULL DEFAULT '0.00',
  `shipping_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `insure_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `pay_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `pack_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `card_fee` decimal(10,2) NOT NULL DEFAULT '0.00',
  `money_paid` decimal(10,2) NOT NULL DEFAULT '0.00',
  `surplus` decimal(10,2) NOT NULL DEFAULT '0.00',
  `integral` int(10) unsigned NOT NULL DEFAULT '0',
  `integral_money` decimal(10,2) NOT NULL DEFAULT '0.00',
  `bonus` decimal(10,2) NOT NULL DEFAULT '0.00',
  `order_amount` decimal(10,2) NOT NULL DEFAULT '0.00',
  `from_ad` smallint(5) NOT NULL DEFAULT '0',
  `referer` varchar(255) NOT NULL DEFAULT '',
  `add_time` int(10) unsigned NOT NULL DEFAULT '0',
  `confirm_time` int(10) unsigned NOT NULL DEFAULT '0',
  `pay_time` int(10) unsigned NOT NULL DEFAULT '0',
  `shipping_time` int(10) unsigned NOT NULL DEFAULT '0',
  `pack_id` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `card_id` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `bonus_id` mediumint(8) unsigned NOT NULL DEFAULT '0',
  `invoice_no` varchar(255) NOT NULL DEFAULT '',
  `extension_code` varchar(30) NOT NULL DEFAULT '',
  `extension_id` mediumint(8) unsigned NOT NULL DEFAULT '0',
  `to_buyer` varchar(255) NOT NULL DEFAULT '',
  `pay_note` varchar(255) NOT NULL DEFAULT '',
  `agency_id` smallint(5) unsigned NOT NULL,
  `inv_type` varchar(60) NOT NULL,
  `tax` decimal(10,2) NOT NULL,
  `is_separate` tinyint(1) NOT NULL DEFAULT '0',
  `parent_id` mediumint(8) unsigned NOT NULL DEFAULT '0',
  `discount` decimal(10,2) NOT NULL,
  PRIMARY KEY (`order_id`),
  UNIQUE KEY `order_sn` (`order_sn`),
  KEY `user_id` (`user_id`),
  KEY `order_status` (`order_status`),
  KEY `shipping_status` (`shipping_status`),
  KEY `pay_status` (`pay_status`),
  KEY `shipping_id` (`shipping_id`),
  KEY `pay_id` (`pay_id`),
  KEY `extension_code` (`extension_code`,`extension_id`),
  KEY `agency_id` (`agency_id`)
) ENGINE=MyISAM AUTO_INCREMENT=21 DEFAULT CHARSET=utf8");
E_D("replace into `ecs_order_info` values('1','2009051298180','1','1','2','2','刘先生','1','2','52','500','[中国 北京 北京 海淀区] 中关村海兴大厦','100085','010-25851234','13986765412','ecshop@ecshop.com','中午','法院','','5','申通快递','1','余额支付','等待所有商品备齐后再发','','','','','','','385.00','15.00','0.00','0.00','0.00','0.00','0.00','400.00','0','0.00','0.00','0.00','0','本站','1242142274','1242142274','1242142274','1242142432','0','0','0','122','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('2','2009051255518','1','4','0','0','刘先生','1','2','52','500','[中国 北京 北京 海淀区] 中关村海兴大厦','100085','010-25851234','13986765412','ecshop@ecshop.com','中午','法院','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','精品包装','祝福贺卡','晚来的祝福','','','960.00','10.00','0.00','0.00','0.00','5.00','0.00','0.00','0','0.00','0.00','0.00','0','本站','1242142324','1242142324','1242142324','1242142389','1','1','0','111','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('3','2009051267570','1','4','0','0','刘先生','1','2','52','500','[中国 北京 北京 海淀区] 中关村海兴大厦','100085','010-25851234','13986765412','ecshop@ecshop.com','中午','法院','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','2300.00','10.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','0.00','0','本站','1242142549','1242142549','1242142549','1242142589','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('4','2009051230249','1','1','0','2','刘先生','1','2','52','500','[中国 北京 北京 海淀区] 中关村海兴大厦','100085','010-25851234','13986765412','ecshop@ecshop.com','中午','法院','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','5999.00','10.00','0.00','0.00','0.00','0.00','0.00','5989.00','0','0.00','20.00','0.00','0','本站','1242142681','1242142681','1242142681','0','0','0','1','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('5','2009051276258','1','1','3','2','刘先生','1','2','52','500','[中国 北京 北京 海淀区] 中关村海兴大厦','100085','010-25851234','13986765412','ecshop@ecshop.com','中午','法院','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','8600.00','10.00','0.00','0.00','0.00','0.00','0.00','8610.00','0','0.00','0.00','0.00','0','本站','1242142808','1242142808','1242142808','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('6','2009051217221','3','3','0','0','叶先生','1','2','52','510','通州区旗舰凯旋小区','','13588104710','','text@ecshop.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','20.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','35.00','0','','1242143292','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('7','2009051227085','3','1','0','0','叶先生','1','2','52','510','通州区旗舰凯旋小区','','13588104710','','text@ecshop.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','2298.00','15.00','0.00','0.00','0.00','0.00','0.00','1000.00','0','0.00','0.00','1198.10','0','','1242143383','1242143454','0','0','0','0','0','','','0','','','0','','0.00','0','0','114.90');");
E_D("replace into `ecs_order_info` values('8','2009051299732','3','0','0','0','叶先生','1','2','52','510','通州区旗舰凯旋小区','','13588104710','','text@ecshop.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','623.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','638.00','0','','1242143444','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('9','2009051210718','3','0','0','0','叶先生','1','2','52','510','通州区旗舰凯旋小区','','13588104710','','text@ecshop.com','','','','5','申通快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','2000.00','15.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','2015.00','0','','1242143732','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('10','2009051268194','1','1','0','2','刘先生','1','2','52','500','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','0.00','10.00','0.00','0.00','0.00','0.00','0.00','10.00','17000','0.00','0.00','0.00','0','','1242143920','1242143920','1242143920','0','0','0','0','','exchange_goods','24','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('11','2009051264945','0','1','0','0','林小姐','1','2','52','500','中关村海兴大厦','','135474510','','linzi@116.com','','','','3','城际快递','2','银行汇款/转帐','','','','','','','','3800.00','10.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','3810.00','0','管理员添加','1242144250','1242144363','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('12','2009051712919','1','2','0','0','刘先生','1','2','52','502','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','3','货到付款','等待所有商品备齐后再发','','','','','','','238.00','10.00','0.00','5.00','0.00','0.00','0.00','0.00','0','0.00','0.00','253.00','0','本站','1242576304','0','0','0','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('13','2009051719232','1','1','1','0','刘先生','1','2','52','502','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','3','货到付款','等待所有商品备齐后再发','','','','','','','960.00','10.00','0.00','5.00','0.00','0.00','0.00','0.00','0','0.00','0.00','975.00','0','本站','1242576341','1242576445','0','1242576445','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('14','2009052224892','1','1','1','2','刘先生','1','2','52','502','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','14045.00','10.00','0.00','0.00','0.00','0.00','0.00','13806.60','0','0.00','5.00','0.00','0','本站','1242976699','1242976699','1242976699','1242976740','0','0','2','1123344','','0','','','0','','0.00','0','0','243.40');");
E_D("replace into `ecs_order_info` values('15','2009061585887','1','4','0','0','刘先生','1','2','52','502','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','17044.00','10.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','17054.00','0','本站','1245044533','1245044587','1245044644','1245045443','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('16','2009061525429','1','1','4','2','刘先生','1','2','52','502','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','3186.30','10.00','0.00','0.00','0.00','0.00','0.00','3196.30','0','0.00','0.00','0.00','0','本站','1245045672','1245045672','1245045672','1245045723','0','0','0','2009061525121','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('17','2009061503335','1','4','0','0','刘先生','1','2','52','502','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','1900.00','10.00','0.00','0.00','0.00','0.00','0.00','0.00','0','0.00','0.00','0.00','0','本站','1245047978','1245047978','1245047978','1245048189','0','0','0','','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('18','2009061510313','1','1','0','2','刘先生','1','2','52','502','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','500.00','10.00','0.00','0.00','0.00','0.00','0.00','500.00','0','0.00','0.00','0.00','0','本站','1245048585','1245048585','1245048585','0','0','0','0','','group_buy','8','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('19','2009061909851','1','1','1','2','刘先生','1','2','52','502','海兴大厦','','010-25851234','13986765412','ecshop@ecshop.com','','','','3','城际快递','1','余额支付','等待所有商品备齐后再发','','','','','','','5567.70','10.00','0.00','0.00','0.00','0.00','0.00','5577.70','0','0.00','0.00','0.00','0','本站','1245384008','1245384008','1245384008','1245384049','0','0','0','232421','','0','','','0','','0.00','0','0','0.00');");
E_D("replace into `ecs_order_info` values('20','2011051108885','0','5','2','2','1111111111','1','3','37','411','111111111','','11111111','','1111111111111@125.COM','','','','3','城际快递','2','银行汇款/转帐','等待所有商品备齐后再发','','','','','','','3460.00','10.00','0.00','0.00','0.00','0.00','3470.00','0.00','0','0.00','0.00','0.00','0','本站','1305119203','1305119500','1305119503','1305119518','0','0','0','','','0','','','0','','0.00','0','0','0.00');");

require("../../inc/footer.php");
?>